//=========================================================================
//**   消息队列服务产品中间件和消息队列服务总线（CeriumX.Messaging）
//=========================================================================
//**   脉脉含情的充满精神的高尚的小强精神
//**   风幽思静繁花落；夜半楼台听江雨。（cockroach888@outlook.com）
//=========================================================================
//**   Copyright © 蟑螂·魂 2022 -- Support 华夏银河空间联盟
//=========================================================================
// 文件名称：MessageServiceFactoryProvider.cs
// 项目名称：消息队列服务产品中间件和消息队列服务总线
// 创建时间：2022-10-10 11:03:41
// 创建人员：宋杰军
// 电子邮件：cockroach888@outlook.com
// 负责人员：宋杰军
// 参与人员：宋杰军
// ========================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ========================================================================
namespace CeriumX.Messaging.LocalMQ;

/// <summary>
/// 消息队列服务创建工厂提供者
/// </summary>
public static class MessageServiceFactoryProvider
{
    /// <summary>
    /// 创建消息队列服务创建工厂
    /// </summary>
    /// <returns>消息队列服务创建工厂</returns>
    public static IMessageServiceFactory Create() => new MessageServiceFactory();
}