//=========================================================================
//**   消息队列服务产品中间件和消息队列服务总线（CeriumX.Messaging）
//=========================================================================
//**   脉脉含情的充满精神的高尚的小强精神
//**   风幽思静繁花落；夜半楼台听江雨。（cockroach888@outlook.com）
//=========================================================================
//**   Copyright © 蟑螂·魂 2022 -- Support 华夏银河空间联盟
//=========================================================================
// 文件名称：IMessageHandler.cs
// 项目名称：消息队列服务产品中间件和消息队列服务总线
// 创建时间：2022-10-09 23:42:05
// 创建人员：宋杰军
// 电子邮件：cockroach888@outlook.com
// 负责人员：宋杰军
// 参与人员：宋杰军
// ========================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ========================================================================
namespace CeriumX.Messaging.Abstractions;

/// <summary>
/// 消息接收处理接口
/// </summary>
/// <typeparam name="TMessage">消息流转泛型</typeparam>
public interface IMessageHandler<TMessage>
    where TMessage : class
{
    /// <summary>
    /// 接收消息
    /// </summary>
    /// <param name="e">消息接收事件参数</param>
    /// <returns>表示响应当前异步操作的支持对象</returns>
    Task OnReceivedAsync(MessageReceivedMsgArgs<TMessage> e);
}