//=========================================================================
//**   消息队列服务产品中间件和消息队列服务总线（CeriumX.Messaging）
//=========================================================================
//**   脉脉含情的充满精神的高尚的小强精神
//**   风幽思静繁花落；夜半楼台听江雨。（cockroach888@outlook.com）
//=========================================================================
//**   Copyright © 蟑螂·魂 2022 -- Support 华夏银河空间联盟
//=========================================================================
// 文件名称：IMessageToken.cs
// 项目名称：消息队列服务产品中间件和消息队列服务总线
// 创建时间：2022-10-09 23:27:15
// 创建人员：宋杰军
// 电子邮件：cockroach888@outlook.com
// 负责人员：宋杰军
// 参与人员：宋杰军
// ========================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ========================================================================
namespace CeriumX.Messaging.Abstractions;

/// <summary>
/// 消息队列订阅令牌接口
/// </summary>
public interface IMessageToken
{
    /// <summary>
    /// 令牌编号
    /// </summary>
    string Id { get; }

    /// <summary>
    /// 消息主题
    /// </summary>
    string Topic { get; }

    /// <summary>
    /// 令牌时间
    /// </summary>
    DateTime Time { get; }


    /// <summary>
    /// 反订阅
    /// </summary>
    /// <returns>表示响应当前异步操作的支持对象</returns>
    ValueTask UnSubscribeAsync();
}